---
title: ConduitSettings
classe: Autodesk.Revit.DB.Electrical.ConduitSettings
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ConduitSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ConnectorSeparator { get; set; }` | `conduitSettings.ConnectorSeparator` | String |
| `Double FittingAnnotationSize { get; set; }` | `conduitSettings.FittingAnnotationSize` | Double |
| `Double RiseDropAnnotationSize { get; set; }` | `conduitSettings.RiseDropAnnotationSize` | Double |
| `String SizePrefix { get; set; }` | `conduitSettings.SizePrefix` | String |
| `String SizeSuffix { get; set; }` | `conduitSettings.SizeSuffix` | String |
| `Boolean UseAnnotationScaleForSingleLineFittings { get; set; }` | `conduitSettings.UseAnnotationScaleForSingleLineFittings` | Boolean |
| `ConduitSettings GetConduitSettings(Document)` | `ConduitSettings.GetConduitSettings(document)` | ConduitSettings |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```